app/Controllers/Admin/DashboardController.php

    public function index()
    {
        $menuModel  = new MenuModel();
        $orderModel = new OrderModel();

        $data = [
            'title'           => 'Dashboard Admin',
            // Statistik menu
            'totalMenu'       => $menuModel->countAllResults(),
            'totalMakanan'    => $menuModel->countByCategory('makanan'),
            'totalMinuman'    => $menuModel->countByCategory('minuman'),
            'totalHabis'      => $menuModel->where('status', 'habis')->countAllResults(),
            // Statistik pesanan
            'totalPesanan'    => $orderModel->countAll(),
---
SELECT COUNT(*) AS `numrows`
FROM `menus`
WHERE `menus`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `menus`
WHERE `status` = 'habis'
AND `menus`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows` FROM `orders`