app/Controllers/Admin/MenuController.php

    public function index()
    {
        $keyword  = $this->request->getGet('q');
        $kategori = $this->request->getGet('kategori');

        $builder = $this->menuModel->orderBy('created_at', 'DESC');

        if (! empty($keyword)) {
            $builder = $builder->like('nama', $keyword);
        }

        if (! empty($kategori)) {
            $builder = $builder->where('kategori', $kategori);
        }

        $data = [
            'title'    => 'Kelola Menu',
            'menus'    => $builder->paginate(8),
            'pager'    => $this->menuModel->pager,
            'keyword'  => $keyword,
            'kategori' => $kategori,
        ];
---
SELECT *
FROM `menus`
WHERE `kategori` = 'minuman'
AND `menus`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 8
SELECT COUNT(*) AS `numrows`
FROM `menus`
WHERE `kategori` = 'minuman'
AND `menus`.`deleted_at` IS NULL