app/Controllers/Admin/PelangganController.php

SELECT *
FROM `pelanggans`
WHERE `pelanggans`.`deleted_at` IS NULL
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `pelanggans`
WHERE `pelanggans`.`deleted_at` IS NULL
---
    public function index()
    {
        $q = $this->request->getGet('q');

        $builder = $this->pelangganModel;
        if ($q) {
            $builder = $this->pelangganModel->like('nama', $q)
                           ->orLike('no_hp', $q)
                           ->orLike('email', $q);
        }

        $data = [
            'title'      => 'Kelola Pelanggan',
            'pelanggans' => $builder->paginate(10),