app/Controllers/Admin/PesananController.php

SELECT *
FROM `orders`
WHERE `status` = 'menunggu'
ORDER BY `created_at` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'menunggu'
---
    public function index(): string
    {
        $statusFilter = $this->request->getGet('status') ?? '';
        $validStatuses = ['menunggu', 'diproses', 'selesai', 'lunas'];

        $this->orderModel->orderBy('created_at', 'DESC');
        if ($statusFilter && in_array($statusFilter, $validStatuses, true)) {
            $this->orderModel->where('status', $statusFilter);
        }

        $orders = $this->orderModel->paginate(10);