app/Models/MenuModel.php

    public function getByCategory(string $kategori): array
    {
        return $this->where('kategori', $kategori)->orderBy('nama', 'ASC')->findAll();
---
SELECT *
FROM `menus`
WHERE `kategori` = 'makanan'
AND `menus`.`deleted_at` IS NULL
ORDER BY `nama` ASC

    public function countByCategory(string $kategori): int
    {
        return $this->where('kategori', $kategori)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `menus`
WHERE `kategori` = 'makanan'
AND `menus`.`deleted_at` IS NULL