app/Models/OrderModel.php

    public function countByStatus(string $status): int
    {
        return $this->where('status', $status)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'menunggu'

    public function countToday(): int
    {
        return $this->where('DATE(created_at)', date('Y-m-d'))->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE DATE(created_at) = '2026-07-05'